Revit 2024 API
LoadCombination.Type Property
 The type of the load combination.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public LoadCombinationType Type { get; set; }
Visual Basic
Public Property Type As LoadCombinationType
	Get
	Set
Visual C++
public:
property LoadCombinationType Type {
	LoadCombinationType get ();
	void set (LoadCombinationType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace